# 單字庫詞表
# 一行一字,小寫;# 開頭為註解,空行忽略。
# 預設為 ~200 字啟動清單(高頻常用詞);可自由增刪。
# 想換成正版 COCA / TOEIC / Oxford 4000,直接整個檔覆蓋即可。
# scripts/generate_vocab.py 會跳過 vocab_bank.json 已存在的字。

# --- 基本動作 ---
get
make
take
give
go
come
see
look
want
need
know
think
feel
work
find
become
leave
help
talk
ask
try
call
seem
keep
start
stop
run
walk
eat
drink
sleep
read
write
learn
teach
buy
sell
pay
send
bring
carry
change
choose
decide
finish
follow
hold
lose
win
watch
listen
hear
speak
say
tell
show
play
sing
dance
drive
build
draw
drop
enjoy
enter
fall
grow
guess
hate
join
laugh
marry
meet
move
open
push
receive
remember
report
rest
return
share
spend
stand
stay
travel
turn
understand
use
wait

# --- 日常名詞 ---
time
year
day
week
month
hour
minute
life
world
family
friend
parent
child
kid
man
woman
person
people
home
house
room
school
work
job
place
way
thing
idea
money
water
food
problem
question
answer
story
news
book
paper
music
sport
game
history
country
city
town
road
car
art
plan
group
team
member
company
business
market
government
law
policy
area
side
part
point
end
moment
age
name
body
face
eye
mind
heart
hand
foot
head
voice
hair
mouth
nose
finger
light
fire
ground
floor
door
window
table
chair
phone
computer
language
picture
gift
dream
hope
peace
war
death
animal
dog
fish
land
sea
rain
snow
sun
summer
winter
morning
night
future
order
power
price
case

# --- 形容詞 ---
good
bad
big
small
new
old
young
long
short
high
low
easy
hard
fast
slow
hot
cold
warm
free
busy
ready
important
true
real
same
different
beautiful
happy
sad
angry
tired
sick
strong
clean
deep
dead
fine
full
kind
late
many
nice
poor
quick
quiet
rich
safe
slow
sorry
stupid
white
black
green
blue
red
yellow

# --- 副詞與時間 ---
always
never
often
sometimes
today
tomorrow
yesterday
soon
together
alone
first
last
next
less
few
nothing
yes
thank

# --- 進階動詞（邁向會話與閱讀） ---
explain
describe
suggest
prepare
improve
increase
reduce
develop
create
manage
provide
offer
accept
refuse
expect
prefer
realize
recognize
discuss
compare
contain
consider
continue
prevent
allow
achieve
avoid
complain
agree
disagree
depend
succeed
fail
repeat
prove
mention
introduce
complete
cause
affect
attend
apply
save
waste
fix
repair
borrow
lend
deliver
search
download
upload
record
design
imagine
realize
admit
announce
arrange
belong
celebrate
communicate
compete
complain
concentrate

# --- 進階名詞 ---
weather
holiday
vacation
weekend
meeting
project
customer
service
product
cost
salary
account
ticket
station
airport
hospital
doctor
patient
medicine
health
exercise
kitchen
garden
street
building
office
factory
environment
nature
season
temperature
energy
machine
tool
material
knowledge
experience
opportunity
decision
reason
result
effect
purpose
goal
success
failure
mistake
advice
opinion
fact
truth
culture
society
economy
technology
science
subject
lesson
exam
traffic
journey
distance

# --- 進階形容詞與連接詞 ---
difficult
possible
impossible
necessary
available
common
similar
various
certain
clear
simple
complex
modern
popular
famous
serious
dangerous
careful
comfortable
expensive
cheap
fresh
healthy
delicious
polite
honest
friendly
nervous
excited
bored
surprised
confused
afraid
lucky
perfect
terrible
wonderful
amazing
boring
interesting
useful
empty
heavy
wide
narrow
soft
sharp
bright
however
therefore
although
finally
usually
probably
maybe
almost
already
still
instead
especially
actually
recently
suddenly
carefully
exactly
perhaps
certainly
