# 單字庫詞表
# 一行一字,小寫;# 開頭為註解,空行忽略。
# 預設為 ~200 字啟動清單(高頻常用詞);可自由增刪。
# 想換成正版 COCA / TOEIC / Oxford 4000,直接整個檔覆蓋即可。
# scripts/generate_vocab.py 會跳過 vocab_bank.json 已存在的字。

# --- 基本動作 ---
get
make
take
give
go
come
see
look
want
need
know
think
feel
work
find
become
leave
help
talk
ask
try
call
seem
keep
start
stop
run
walk
eat
drink
sleep
read
write
learn
teach
buy
sell
pay
send
bring
carry
change
choose
decide
finish
follow
hold
lose
win
watch
listen
hear
speak
say
tell
show
play
sing
dance
drive
build
draw
drop
enjoy
enter
fall
grow
guess
hate
join
laugh
marry
meet
move
open
push
receive
remember
report
rest
return
share
spend
stand
stay
travel
turn
understand
use
wait

# --- 日常名詞 ---
time
year
day
week
month
hour
minute
life
world
family
friend
parent
child
kid
man
woman
person
people
home
house
room
school
work
job
place
way
thing
idea
money
water
food
problem
question
answer
story
news
book
paper
music
sport
game
history
country
city
town
road
car
art
plan
group
team
member
company
business
market
government
law
policy
area
side
part
point
end
moment
age
name
body
face
eye
mind
heart
hand
foot
head
voice
hair
mouth
nose
finger
light
fire
ground
floor
door
window
table
chair
phone
computer
language
picture
gift
dream
hope
peace
war
death
animal
dog
fish
land
sea
rain
snow
sun
summer
winter
morning
night
future
order
power
price
case

# --- 形容詞 ---
good
bad
big
small
new
old
young
long
short
high
low
easy
hard
fast
slow
hot
cold
warm
free
busy
ready
important
true
real
same
different
beautiful
happy
sad
angry
tired
sick
strong
clean
deep
dead
fine
full
kind
late
many
nice
poor
quick
quiet
rich
safe
slow
sorry
stupid
white
black
green
blue
red
yellow

# --- 副詞與時間 ---
always
never
often
sometimes
today
tomorrow
yesterday
soon
together
alone
first
last
next
less
few
nothing
yes
thank

# --- 進階動詞（邁向會話與閱讀） ---
explain
describe
suggest
prepare
improve
increase
reduce
develop
create
manage
provide
offer
accept
refuse
expect
prefer
realize
recognize
discuss
compare
contain
consider
continue
prevent
allow
achieve
avoid
complain
agree
disagree
depend
succeed
fail
repeat
prove
mention
introduce
complete
cause
affect
attend
apply
save
waste
fix
repair
borrow
lend
deliver
search
download
upload
record
design
imagine
realize
admit
announce
arrange
belong
celebrate
communicate
compete
complain
concentrate

# --- 進階名詞 ---
weather
holiday
vacation
weekend
meeting
project
customer
service
product
cost
salary
account
ticket
station
airport
hospital
doctor
patient
medicine
health
exercise
kitchen
garden
street
building
office
factory
environment
nature
season
temperature
energy
machine
tool
material
knowledge
experience
opportunity
decision
reason
result
effect
purpose
goal
success
failure
mistake
advice
opinion
fact
truth
culture
society
economy
technology
science
subject
lesson
exam
traffic
journey
distance

# --- 進階形容詞與連接詞 ---
difficult
possible
impossible
necessary
available
common
similar
various
certain
clear
simple
complex
modern
popular
famous
serious
dangerous
careful
comfortable
expensive
cheap
fresh
healthy
delicious
polite
honest
friendly
nervous
excited
bored
surprised
confused
afraid
lucky
perfect
terrible
wonderful
amazing
boring
interesting
useful
empty
heavy
wide
narrow
soft
sharp
bright
however
therefore
although
finally
usually
probably
maybe
almost
already
still
instead
especially
actually
recently
suddenly
carefully
exactly
perhaps
certainly

# === 擴充批次：高頻 / 學術 / 職場 / 生活實用字 ===
abandon
ability
absolute
absorb
abstract
academic
accelerate
acceptable
access
accommodate
accompany
accurate
accuse
acknowledge
acquire
adapt
adequate
adjust
administer
admire
adopt
advance
advantage
adventure
advertise
advocate
aesthetic
affair
afford
aggressive
agriculture
alarm
allocate
alter
alternative
ambition
ambitious
amend
amount
analogy
ancestor
anchor
anniversary
annual
anticipate
anxiety
apparent
appeal
appliance
applicant
appoint
appreciate
appropriate
approve
approximate
arbitrary
architect
arctic
arise
arrest
article
artificial
ascend
aspect
assemble
assess
asset
assign
assist
associate
assure
astonish
atmosphere
attach
attain
attempt
attitude
attract
attribute
audience
authentic
authority
automatic
autonomy
average
aware
awkward
bachelor
balance
ban
bargain
barrier
basis
behave
behalf
beloved
beneath
betray
beverage
bias
bid
bizarre
blame
blend
bless
bloom
blossom
boast
bold
boost
border
boundary
breed
brief
brilliant
broad
budget
bulk
bureau
burden
bury
calculate
campaign
cancel
candidate
capacity
capture
career
carve
casual
category
caution
cease
ceremony
certificate
challenge
chamber
chaos
characteristic
charity
charm
cherish
chronic
circulate
circumstance
citizen
civil
clarify
classic
client
climate
cling
clue
coarse
coherent
coincide
collapse
colleague
collide
combine
comment
commerce
commission
commit
commodity
commute
compact
companion
compatible
compel
compensate
competent
compile
complement
complicated
comply
compose
comprehend
comprehensive
compromise
conceal
concede
conceive
concept
concern
conclude
concrete
condemn
conduct
confess
confident
confine
confirm
conflict
conform
confront
confuse
congress
conquer
conscience
conscious
consecutive
consensus
consent
conserve
considerable
consist
console
conspire
constant
constitute
construct
consult
consume
contaminate
contemporary
contempt
content
context
contract
contradict
contrary
contrast
contribute
controversy
convenient
convention
converse
convert
convey
convince
cooperate
coordinate
cope
core
corporate
correspond
corrupt
costume
counsel
counter
courage
courtesy
crack
craft
crash
crawl
credit
crew
crisis
criterion
critical
criticize
crucial
crude
cruel
crush
cultivate
curiosity
currency
current
curse
custom
dare
deadline
deal
debate
debt
decade
decay
deceive
declare
decline
dedicate
deduce
defeat
defend
deficit
define
defy
delay
delegate
deliberate
delicate
demand
democracy
demonstrate
denote
dense
deny
depart
depict
deposit
deprive
derive
descend
deserve
designate
desire
despair
desperate
despise
destination
destiny
destroy
detail
detect
determine
devastate
device
devise
devote
diagnose
dialect
differ
dignity
diligent
dimension
diminish
diplomatic
disable
disaster
discard
discharge
discipline
disclose
discount
discourage
discover
discriminate
disguise
disgust
dismiss
disorder
dispatch
dispense
disperse
display
dispose
dispute
disrupt
dissolve
distant
distinct
distinguish
distort
distract
distribute
district
disturb
diverse
divert
divine
divorce
document
domestic
dominate
donate
doom
dose
draft
drain
dramatic
drift
drought
dual
dump
durable
duration
dwell
dynamic
eager
earn
ease
echo
ecology
economic
edit
educate
efficient
elaborate
elastic
elderly
elect
elegant
element
elevate
eligible
eliminate
eloquent
embarrass
embrace
emerge
emergency
emit
emotion
emphasize
empire
employ
empower
enable
enclose
encounter
encourage
endeavor
endure
enforce
engage
enhance
enormous
enrich
enroll
ensure
enterprise
entertain
enthusiasm
entire
entitle
entrepreneur
envelope
envy
episode
equate
equip
equivalent
erect
erupt
escape
essential
establish
estate
esteem
estimate
eternal
ethic
evaluate
evident
evoke
evolve
exaggerate
examine
exceed
excel
exception
excess
exchange
exclude
execute
exempt
exert
exhaust
exhibit
exile
exist
expand
expedition
expel
expense
experiment
expert
expire
explicit
exploit
explore
expose
express
exquisite
extend
extension
external
extinct
extract
extraordinary
extreme
fabric
fabulous
facilitate
faculty
fade
faint
fairy
faith
fame
familiar
famine
fancy
fantasy
fascinate
fatal
fate
fatigue
feasible
feature
federal
fee
feedback
fellow
ferry
fertile
fetch
fiber
fierce
figure
finance
fingerprint
finite
flame
flap
flavor
flaw
flee
flexible
flourish
fluent
fluid
focus
forbid
forecast
foresee
forge
formal
format
formula
forsake
fortune
forum
fossil
foster
foundation
fraction
fragile
fragment
framework
frank
fraud
freight
frequent
friction
frontier
frustrate
fulfill
function
fundamental
funeral
furious
furnish
gallop
gaze
gene
generate
generous
genius
genuine
geography
gesture
giant
glance
glimpse
glitter
globe
glorious
glow
govern
grace
gradual
grain
grant
graphic
grasp
grateful
gravity
graze
greed
grief
grin
grip
groan
grocery
gross
guarantee
guardian
guideline
guilt
habitat
halt
handful
harassment
harbor
hardware
harmony
harsh
harvest
haste
hatch
haunt
hazard
headquarters
heal
heap
heir
hemisphere
herald
heritage
hesitate
hierarchy
highlight
hinder
hint
historic
hollow
homogeneous
honor
horizon
horror
hospitality
hostile
household
hover
humble
humid
humiliate
hypothesis
identical
identify
ideology
idle
ignite
ignore
illuminate
illustrate
imitate
immense
immigrate
imminent
immune
impact
impair
impart
impeach
implement
implicit
imply
import
impose
impress
imprison
impulse
incentive
incident
incline
include
income
incorporate
incredible
incur
indeed
indicate
indifferent
indigenous
indispensable
individual
induce
indulge
industrial
inevitable
infant
infect
infer
inferior
infinite
inflate
inflict
influence
inform
infrastructure
ingredient
inhabit
inherent
inherit
inhibit
initial
initiate
inject
injure
innocent
innovate
input
inquire
insert
insight
insist
inspect
inspire
install
instance
instinct
institute
instruct
insult
insure
intact
integrate
integrity
intellectual
intend
intense
interact
interfere
interior
intermediate
internal
interpret
interrupt
interval
intervene
intimate
intrigue
intrinsic
intrude
intuition
invade
invent
invest
investigate
invisible
invoke
involve
isolate
issue
item
jealous
jeopardy
journal
judicial
junction
justify
juvenile
keen
kidnap
kindle
knot
label
labor
landscape
launch
lawsuit
layer
leak
lean
leap
lecture
legacy
legal
legend
legislate
legitimate
leisure
liable
liberal
liberate
license
linger
linguistic
liquid
literal
literacy
literature
litter
livestock
locate
logic
loose
loyal
luggage
luminous
lunar
luxury
magnet
magnificent
magnitude
maintain
major
mammal
mandate
maneuver
manifest
manipulate
manual
manufacture
manuscript
marble
margin
marine
marvel
mason
massive
master
mature
maximum
mayor
meadow
meanwhile
measure
mechanic
mediate
medieval
meditate
medium
melancholy
melody
melt
memorial
merchant
mercy
mere
merge
merit
metaphor
migrate
mild
military
mimic
mineral
minimal
minister
minor
miracle
mischief
miserable
misery
mislead
mobile
mock
moderate
modest
modify
moist
molecule
momentum
monetary
monitor
monopoly
monotonous
monument
moral
moreover
mortal
motive
mount
mourn
multiple
municipal
murmur
muscle
mutual
mysterious
naive
narrate
nasty
navigate
necessity
negative
neglect
negotiate
nerve
neutral
nevertheless
niche
noble
nominate
nonsense
norm
notable
notify
notion
notorious
nourish
novel
nuisance
numerous
nursery
nurture
oath
obedient
obey
object
oblige
obscure
observe
obsess
obstacle
obtain
obvious
occasion
occupy
occur
odor
offend
offspring
omit
ongoing
opponent
oppose
oppress
optimistic
option
oral
orbit
ordeal
organic
orient
origin
ornament
orphan
otherwise
outbreak
outcome
outgoing
outlet
outline
outlook
output
outrage
outstanding
overall
overcome
overdue
overhead
overlap
overlook
overnight
overseas
overtake
overthrow
overwhelm
owe
panic
parade
paradox
parallel
paralyze
parcel
pardon
participate
partial
passion
passive
pasture
patent
path
patriot
patron
pause
pave
peculiar
pedal
peer
penalty
pension
perceive
perish
permanent
permit
perpetual
persist
perspective
persuade
pessimistic
petition
petty
phase
phenomenon
philosophy
physician
pierce
pile
pilgrim
pillar
pinch
pioneer
pirate
pity
plague
plea
pleasant
pledge
plentiful
plot
plunge
poetry
poison
polar
polish
poll
pollute
ponder
portion
portray
pose
positive
possess
postpone
posture
potential
pottery
poverty
practical
praise
preach
precaution
precede
precious
precise
predator
predict
preface
pregnant
prejudice
preliminary
premise
premium
prescribe
presence
preserve
preside
prestige
presume
pretend
prevail
previous
prey
priceless
primary
prime
primitive
principal
principle
prior
priority
privilege
probe
proceed
proclaim
productive
profession
profile
profit
profound
progress
prohibit
prolong
prominent
promote
prompt
prone
pronounce
proof
propaganda
propel
proper
property
prophet
proportion
proposal
prosecute
prospect
prosper
protective
protein
protest
protocol
prototype
provided
province
provision
provoke
prudent
psychology
publish
punctual
punish
purchase
pursue
puzzle
qualify
quarrel
quench
quest
quote
racial
radiant
radical
rage
raid
random
range
rank
rapid
rare
rational
raw
readily
rebel
recall
recede
receipt
reception
recession
recipe
recite
reckless
reckon
recommend
reconcile
recover
recreate
recruit
rectangle
recur
recycle
redeem
refer
refine
reflect
reform
refresh
refuge
refund
regard
regime
region
register
regret
regular
regulate
rehearse
reign
reinforce
reject
rejoice
relate
relax
release
relevant
reliable
relief
religion
relish
reluctant
rely
remark
remedy
remind
reminiscent
remote
removal
render
renew
renowned
repay
repel
replace
represent
reproduce
reptile
republic
reputation
request
require
rescue
resemble
resent
reserve
reside
resign
resist
resolve
resort
resource
respective
respond
restless
restore
restrain
restrict
resume
retail
retain
retire
retreat
retrieve
reveal
revenge
revenue
reverse
review
revise
revive
revolt
revolve
reward
rhythm
rid
ridiculous
rigid
rigorous
riot
ripe
ritual
rival
roam
roar
robust
romantic
rotate
route
routine
royal
rubbish
rude
ruin
rural
sacred
sacrifice
saint
sake
salient
salute
sanction
sanctuary
sane
satellite
satisfy
savage
scale
scan
scandal
scarce
scatter
scenario
scent
scheme
scholar
scope
scorn
scramble
scrap
scrape
scratch
scream
screen
scrutiny
sculpture
seal
secure
seek
segment
seize
seldom
select
seminar
senate
sensation
sensible
sensitive
sentiment
separate
sequence
serene
sergeant
serial
sermon
servant
session
settle
severe
sew
shabby
shallow
shatter
shed
sheer
shelter
shield
shift
shiver
shortage
shrewd
shriek
shrimp
shrink
shrug
sibling
siege
sigh
signal
signature
significant
simulate
simultaneous
sincere
singular
sip
site
situate
skeleton
skeptical
sketch
skull
slap
slavery
slender
slight
slope
slot
slum
sly
smash
smooth
smother
snap
soak
soar
sober
sociable
solar
sole
solemn
solid
solitary
solitude
soluble
solve
somber
soothe
sophisticated
sorrow
source
souvenir
sovereign
spacious
span
spare
spark
sparkle
spear
specialize
species
specific
specify
specimen
spectacle
spectrum
speculate
sphere
spice
spill
spin
spine
spiral
spit
splash
splendid
split
spoil
sponsor
spontaneous
spouse
sprawl
spray
sprinkle
sprout
spur
squad
squash
squat
squeeze
stab
stable
stack
stagger
stain
stake
stall
stammer
stance
standard
staple
stare
startle
starve
statement
static
statistics
status
steady
steep
steer
stem
stereotype
sterile
stern
stew
sticky
stiff
stimulate
sting
stir
stitch
stock
stoop
straightforward
strain
strait
strand
strategy
stray
streak
stream
strengthen
strenuous
stress
stretch
strict
stride
strife
strike
string
strip
strive
stroke
stroll
structure
struggle
stubborn
stuff
stumble
stun
sturdy
submarine
submerge
submit
subordinate
subscribe
subsequent
subside
subsidy
substance
substitute
subtle
suburb
sufficient
suffocate
suicide
suitable
summarize
summit
summon
superb
superficial
superior
supervise
supplement
suppose
suppress
supreme
surge
surpass
surplus
surrender
surround
surveillance
survey
survive
suspect
suspend
suspicion
sustain
swamp
swarm
sway
swear
sweep
swell
swift
symbol
sympathy
symptom
synthesis
systematic
tackle
tactics
talent
tame
tangle
target
tariff
tease
tedious
temper
temperate
temple
tempo
temporary
tempt
tenant
tend
tender
tense
tentative
terminal
terminate
terrific
territory
terror
testify
testimony
texture
theme
theory
therapy
thermometer
thorn
thorough
thread
threat
thrift
thrill
thrive
throne
thrust
thumb
thunder
tide
tidy
tilt
timber
timid
tiresome
token
tolerate
toll
torment
torture
toss
tournament
toxic
trace
tract
tradition
tragedy
trail
trait
tranquil
transaction
transcend
transfer
transform
transit
translate
transmit
transparent
transplant
transport
trap
trauma
tread
treasure
treaty
tremble
tremendous
trench
trend
trespass
trial
tribe
tribute
trick
trigger
trim
triumph
trivial
troop
tropical
trophy
tropic
trouble
truce
trumpet
trustee
tuition
tumble
tuck
tumor
tune
turbulent
tutor
twilight
twist
typical
tyranny
ultimate
unanimous
uncover
undergo
undermine
undertake
undo
unfold
uniform
unify
unique
unite
universal
unveil
update
upgrade
uphold
upright
uproar
upset
urban
urge
urgent
usage
utensil
utility
utilize
utmost
utter
vacant
vacuum
vague
vain
valid
valley
valuable
vanish
vanity
vapor
variable
vary
vast
vault
vehicle
veil
vein
velocity
venture
verbal
verdict
verge
verify
versatile
version
versus
vertical
vessel
veteran
veto
vibrate
vice
vicious
victim
vigorous
violate
violent
virtual
virtue
visible
vision
visual
vital
vivid
vocabulary
vocation
void
volcano
volume
voluntary
vomit
vote
vow
voyage
vulgar
vulnerable
wage
wander
ward
warehouse
warfare
warn
warrant
weary
weave
wedge
weep
weird
welfare
whatsoever
wheat
whereas
whirl
whisper
wholesale
wicked
widespread
wilderness
willing
wisdom
withdraw
wither
withhold
withstand
witness
witty
woe
workshop
worship
worthwhile
worthy
wreck
wrestle
wretched
wrinkle
yearn
yield
zeal
zone
